alplabai/cc3501e-bridge-firmware/ti/cc3501e_aen_wifi.syscfg
/* CS0 (GPIO31) and CS1 (GPIO15) deliberately get NO pin resource here -- the
 * HAL owns them via GPIO_setConfig()/GPIO_write(), the same way the camera LDO
 * enables on GPIO_0/GPIO_1 are driven (both are GPIOWFF3_DO_NOT_CONFIG in the
 * generated table, and both are bench-PASS).  They must be configured as
 * outputs idling HIGH before the first transfer, and gpio_pad_reserved() in
 * hal/ti/cc3501e_hw_ti_gpio.c must refuse pads 15/31/32/33/34 -- otherwise a
 * host CMD_GPIO_CONFIGURE/WRITE re-muxes SCK or a data line out from under an
 * in-flight transfer, which is exactly why 16/27/28/29 are refused already.
 *
 * Host-facing cs=0 is device SPI1_CS1 and cs=1 is device SPI1_CS2: TI numbers
 * the device SIGNALS from 1 while the driver numbers SELECTS from 0 (spi0's
 * csnPin GPIO16 is SPI0_CS1 and generates .csnSel = SPI_CSSEL_CS0).  Keep the
 * host-facing names 0/1 -- they follow the CONNECTOR nets WIFI_SPI1.CS0/CS1. */

/* DMA channels, pinned for the same reason spi0 pins 12/13: on this SDK an
 * AUTO-assigned channel was observed being re-pointed by the radio (ch11, then
 * ch8/ch6, all died mid-transfer) while an explicitly pinned pair never was.
 * Both SPI instances may use DMA_CH0..DMA_CH13 (CC3551E.json DMA_SPI_1_RX/TX),
 * so this pair is the highest two that are neither the bridge's own 12/13 nor
 * any channel the radio was seen to steal.  Sharing a channel with
 * CONFIG_SPI_0 would BE the wedge, so never "simplify" these back to 12/13.
 *
 * ASSUMPTION, NOT A BENCH RESULT: the 12/13 observation does not transfer to
 * 9/10.  Scope it under radio load (a wifi scan concurrent with a 4088-byte
 * transfer) before trusting it.  If the radio does steal them the failure is
 * loud and contained: SPI_transfer() returns false, the passthrough maps that
 * to RESP_ERR_STATE (a terminal reject, not a retry), and the inter-chip
 * bridge on 12/13 is untouched.  The fallback is the polling path --
 * build_ti.ps1 rewrites .minDmaTransferSize to 1024 for EVERY instance in the
 * generated file, so a SPI_MODE_BLOCKING controller transfer shorter than 1024
 * bytes skips DMA entirely; a smaller host chunk therefore trades throughput
 * for independence from the DMA mux.  (Side note for whoever next touches that
 * script: its post-condition greps for a single ".minDmaTransferSize = 1024,",
 * so with two instances it no longer proves full coverage.) */
spi1.spi.dmaRxChannel.$assign = "DMA_CH9";
spi1.spi.dmaTxChannel.$assign = "DMA_CH10";

/* ======== UART2 (console glue) -> CONFIG_UART2_0 ========
 * Required only by the Wi-Fi host integration's uart_term.c/syslog.c so the
 * link resolves; unused at runtime on the headless bridge.  Pins GPIO5/GPIO6
 * (XDS110 default) are clear of the SPI pads. */
/* ======== ADC: internal temperature sensor (errata RADIO_01, #18) ========
 *
 * Advisory RADIO_01 (SWRZ167) says the RF core does not limit radio activity at
 * 105C > TA > 85C, and the workaround is to limit TX or disable the radios above
 * 85C.  Neither half is implemented, and the reason is that nothing in this
 * firmware could read the die temperature at all.  This instantiates the channel
 * so raw codes can be captured; it does NOT implement a trip.
 *
 * `internalSignal = "Temperature Channel"` is the supported pinless path:
 * ADCWFF3Channel.syscfg.js's pinmuxRequirements() returns [] whenever
 * internalSignal != "None", so this consumes NO pad and cannot collide with the
 * inter-chip SPI pads (GPIO16/27/28/29) or the camera LDO enables on
 * GPIO_0/GPIO_1.
 *
 * DELIBERATELY NO TRIP THRESHOLD.  TI has not published a transfer function,
 * gain/offset trim or OTP location for internal channel 11 in SWRU626, SWRS343A,
 * SLUUDH6 or SDAA244A, so a raw code cannot be converted to degrees C.  A
 * threshold guessed from an uncalibrated code fails in BOTH directions: set too
 * high it does not protect against a documented device-damage condition, set too
 * low it silently disables Wi-Fi and BLE on a healthy unit in an enclosure.  The
 * raw code is exposed to the bench probe only, to characterise the channel and
 * to give TI a concrete anchor for the transfer-function question.
 */
var ADC   = scripting.addModule("/ti/drivers/ADC");
var adc0  = ADC.addInstance();
adc0.$name                        = "CONFIG_ADC_TEMP";
adc0.adcChannel.$name             = "CONFIG_ADC_TEMP_CHANNEL";
adc0.adcChannel.internalSignal    = "Temperature Channel";
adc0.adcChannel.referenceSource   = "ADCWFF3_INTERNAL_REFERENCE";

var UART2 = scripting.addModule("/ti/drivers/UART2");
var uart0 = UART2.addInstance();
uart0.$name = "CONFIG_UART2_0";
uart0.uart.txPin.$assign = "GPIO5";
uart0.uart.rxPin.$assign = "GPIO6";
